{
    "carl-bergenhem": {
        "slug": "carl-bergenhem",
        "firstName": "Carl",
        "lastName": "Bergenhem",
        "bio": "Carl Bergenhem is a Developer Support Specialist at [Telerik](http://www.telerik.com/) where he works with their ASP.NET Ajax, Silverlight, and WPF controls as well as their Reporting, OpenAccess ORM, JustCode, and WebUI Test Studio tools. Among these products he specializes mostly in the ASP.NET Ajax and WebUI Test Studio products. Telerik is a provider of development tools and user interface components for the .NET framework and they strive to provide developers with the tools to make their developing life as easy as possible.",
        "sessions": [
            "silverlight-part-2"
        ]
    },
    "adam-bouchard": {
        "slug": "adam-bouchard",
        "firstName": "Adam",
        "lastName": "Bouchard",
        "bio": "Adam Bouchard is a web application developer and entrepreneur living in Burlington, Vermont. Over the past few years Adam has helped conceptualize and implement both web based products and business process tools during his work at [Draker Laboratories](http://www.drakerlabs.com/), a renewable energy monitoring company.",
        "sessions": [
            "ruby-introduction"
        ]
    },
    "chris-bowen": {
        "slug": "chris-bowen",
        "firstName": "Chris",
        "lastName": "Bowen",
        "bio": "Chris Bowen ([http://blogs.msdn.com/cbowen](http://blogs.msdn.com/cbowen)) is a Developer Evangelist with Microsoft, covering the Northeastern US. An architect and developer with over 17 years of experience, he joined Microsoft after holding senior positions at companies including Monster.com, VistaPrint, Staples, and IDX Systems, as well as consulting with others. He is coauthor of \"Essential Windows Communication Foundation\" and \"Professional Visual Studio 2005 Team System\" and holds an M.S. in Computer Science and a B.S. in Management Information Systems, both from Worcester Polytechnic Institute. Chris can be found on Twitter as @[ChrisBowen](http://twitter.com/ChrisBowen).",
        "twitter": {
            "href": "http://twitter.com/ChrisBowen",
            "title": "ChrisBowen"
        },
        "sessions": [
            "webmatrix"
        ]
    },
    "tom-cooley": {
        "slug": "tom-cooley",
        "firstName": "Tom",
        "lastName": "Cooley",
        "bio": "Tom Cooley is the Principal Software Architect for [MyWebGrocer](http://mywebgrocer.com/) in Colchester, VT. He has been designing and developing enterprise software systems for more than 20 years. His focus is on object-oriented design and on mentoring developers to use and understand both software and architectural design patterns and principles. He is the co-leader of the VT SQL Server User Group and a presenter at code camps and user group events. Tom can be found on Twitter as @[tom_cooley](http://twitter.com/tom_cooley).",
        "twitter": {
            "href": "http://twitter.com/tom_cooley",
            "title": "tom_cooley"
        },
        "sessions": [
            "bdd"
        ]
    },
    "christian-cote": {
        "slug": "christian-cote",
        "firstName": "Christian",
        "lastName": "Coté",
        "bio": "Christian blogs at [http://bi-blogger.typepad.com/](http://bi-blogger.typepad.com/) and can be found on Twitter as @[Christian_SQL](http://twitter.com/Christian_SQL).</a>",
        "twitter": {
            "href": "http://twitter.com/Christian_SQL",
            "title": "Christian_SQL"
        },
        "sessions": [
            "ssis-advanced"
        ]
    },
    "michael-cummings": {
        "slug": "michael-cummings",
        "firstName": "Michael",
        "lastName": "Cummings",
        "bio": "Principal systems analyst and software engineer, currently employed with Magenic, Inc., a Microsoft Gold Partner. An experienced technical lead with strengths in systems architecture, software development, infrastructure design & deployment, and business process as it relates to technology. Holding multiple certifications from Microsoft and other certifying organizations, including MCP, MCT, MCSD, MCSE, and MCDBA. A Dedicated community leader, who speaks at local user groups and code camps.Has been a hobby graphics programmer since the days of the TI99-4/A. Most of the day he's busy developing business applications, but that doesn't stop working on games and graphics engines. Started the [Boston XNA Developers Group](http://www.bostonxna.org/), and has spoken at several user groups and other events on the topic of XNA and games. Has contributed to many open source projects, including [AXIOM](http://axiom3d.net/), a .Net/Mono 3D rendering engine, and [Planeshift](http://www.planeshift.it/), a 3D MMORPG. His blog can be found at [http://www.geekswithblogs.net/mathoms](http://www.geekswithblogs.net/mathoms) and he can be found on Twitter as @[mcummings](http://twitter.com/mcummings).",
        "twitter": {
            "href": "http://twitter.com/mcummings",
            "title": "mcummings"
        },
        "sessions": [
            "xna-advanced",
            "xna-games-windows-phone"
        ]
    },
    "kathleen-dollard": {
        "slug": "kathleen-dollard",
        "firstName": "Kathleen",
        "lastName": "Dollard",
        "bio": "Kathleen Dollard is a consultant, author, trainer, and speaker. She's been a Microsoft MVP for over ten years and has spoken about .NET in 28 states and 5 countries. She's written dozens of articles including the \"Ask Kathleen\" column in Visual Studio Magazine. She also wrote \"Code Generation in Microsoft .NET\" (Apress). Her passion is helping programmers be smarter in how they develop by learning to better use .NET languages, libraries and platforms. She works with WPF, WF, as well as core technologies including System.AddIn. She's currently creating template infrastructure for code generation using VB XML literals. After working on the problem of capturing business intent in metadata and test definitions for years, she's working with industry improvements in these areas. She's also working on full life cycle improvements, such as unit testing, better debugging and static analysis (FxCop). When not working, she enjoys woodworking, snowshoeing, and kayaking depending on the outdoor temperature. Kathleen's blog, Leaning into Windows, can be found at [http://msmvps.com/blogs/kathleen](http://msmvps.com/blogs/kathleen/) and she can be found on Twitter as @[KathleenDollard](http://twitter.com/KathleenDollard).",
        "twitter": {
            "href": "http://twitter.com/KathleenDollard",
            "title": "KathleenDollard"
        },
        "sessions": [
            "mef",
            "visual-studio-tips-tricks"
        ]
    },
    "john-garland": {
        "slug": "john-garland",
        "firstName": "John",
        "lastName": "Garland",
        "bio": "John is a Senior Consultant at Wintellect and has been developing software professionally for over 12 years, having spent most of his career working on high-performance video and statistical analysis tools for premier sports teams, with an emphasis on the NFL, the NBA, and Division 1 NCAA Football and Basketball. Prior to joining Wintellect, John worked for Burntsand Consulting, working with both large and small enterprises using .Net technologies for applications including purchase management, logistics, and insurance solutions. John lives in New Hampshire with his wife and daughter, where he is active in the New England development community, speaking at Code Camp and User Group events.  When he isn't finding cause for yet another upgrade to his WMC-based home entertainment system, he occasionally turns to motorcycling and Florida Gator Football to unplug.  He is a graduate of the University of Florida with a Bachelor's degree in Computer Engineering.",
        "sessions": [
            "windows-phone-silverlight"
        ]
    },
    "vincent-grondin": {
        "slug": "vincent-grondin",
        "firstName": "Vincent",
        "lastName": "Grondin",
        "bio": "Vincent Grondin has over 12 years of experience in the software development field and has been using .NET in enterprise projects for 7 years now. He was involved in many enterprise projects for large corporations like Desjardins, Domtar, Cascades and Alcoa but was also part of a few projects for various government branches. He likes to learn new technologies related to .NET, use the new tools that are designed for .NET and loves to share it all with his peers. Yes, he's a confessed .NET addict and is currently working at DMR, a Fujitsu company, as a Consultant. Vincent is one of the leaders for the .NET usergroup in Montréal and a C# MVP.  You can read his blogs at [geekswithblogs.net/vincentgrondin](http://geekswithblogs.net/vincentgrondin).",
        "sessions": [
            "lambdas-visual-studio"
        ]
    },
    "bradley-holt": {
        "slug": "bradley-holt",
        "firstName": "Bradley",
        "lastName": "Holt",
        "bio": "Bradley Holt is a web developer, entrepreneur, community facilitator, and an advocate of free/open source software, open standards, and open content (e.g. Creative Commons). He is the co-founder of [Found Line](http://foundline.com/), a Burlington-based creative studio with capabilities in web development, graphic design, and marketing strategy. He has ten years of experience with PHP and MySQL and is a Zend Certified Engineer in Zend Framework (ZCE-ZF) with three years of experience building Zend Framework applications. He is also a contributor of source code and bug reports to Zend Framework and an active member of the PHP community. He organizes the [Burlington, VT PHP Users Group](http://groups.google.com/group/burlington-vt-php). Bradley blogs at [bradley-holt.com](http://bradley-holt.com/) and can be found on Twitter as @[BradleyHolt](http://twitter.com/BradleyHolt).",
        "twitter": {
            "href": "http://twitter.com/BradleyHolt",
            "title": "BradleyHolt"
        },
        "sessions": [
            "php-introduction",
            "user-groups"
        ]
    },
    "jesse-kliza": {
        "slug": "jesse-kliza",
        "firstName": "Jesse",
        "lastName": "Kliza",
        "bio": "As Director of Marketing for [Apprenda](http://apprenda.com/), Jesse is responsible for the creation and execution of Apprenda's strategic marketing initiatives, generating demand and awareness, and evolving the company's brand. Jesse draws from a strong background in Software as a Service, having served as Community Evangelist and Product Manager at SaaS ISV Autotask before joining Apprenda. Prior to Autotask, Jesse served as Director of Marketing at Eden Communications (acquired by Unicom Systems). Jesse holds a Bachelor's Degree in Information Technology, with a focus in Neuroscience from Rensselaer Polytechnic Institute. Jesse can be found on Twitter as @[kliza23](http://twitter.com/kliza23).",
        "twitter": {
            "href": "http://twitter.com/kliza23",
            "title": "kliza23"
        },
        "sessions": [
            "cloud-software-fail"
        ]
    },
    "slava-kokaev": {
        "slug": "slava-kokaev",
        "firstName": "Slava",
        "lastName": "Kokaev",
        "bio": "Principal BI Developer/Architect, Mentor, INETA Regional Speaker and NE Microsoft Business Intelligence Community Leader specializing in Business Intelligence Systems, Custom BI Web Applications and BI Integration. Slava blogs at [bostonbi.org/blog.aspx](http://bostonbi.org/blog.aspx).",
        "sessions": [
            "olap"
        ]
    },
    "kathleen-macmahon": {
        "slug": "kathleen-macmahon",
        "firstName": "Kathleen",
        "lastName": "MacMahon",
        "bio": "Kathleen MacMahon is a Software Development Manager for [Harmony Information Systems](http://www.harmonyis.com/) with over ten years development experience. Current project is a an Enterprise Software Solution, developed in Silverlight 4.0, .NET 4.0 and WCF RIA Services. Kathleen can be found on Twitter as @[kmacmahon](http://twitter.com/kmacmahon).",
        "twitter": {
            "href": "http://twitter.com/kmacmahon",
            "title": "kmacmahon"
        },
        "sessions": [
            "prism-introduction"
        ]
    },
    "everett-mckay": {
        "slug": "everett-mckay",
        "firstName": "Everett",
        "lastName": "McKay",
        "bio": "Everett McKay is the principal of [UX Design Edge](http://www.uxdesignedge.com/), a user experience design consulting and training firm specializing in helping non-designers based in St. Albans. Previously, he was a program manager at Microsoft on the Windows 7 and Windows Vista teams, and was responsible for the [Windows User Experience Interaction Guidelines](http://msdn.microsoft.com/en-us/library/aa511258.aspx).",
        "sessions": [
            "ui-ux"
        ]
    },
    "jim-oneil": {
        "slug": "jim-oneil",
        "firstName": "Jim",
        "lastName": "O'Neil",
        "bio": "Jim is one of the two Microsoft Developer Evangelists covering New England and upstate New York. He has over 20 years experience in software development and support having worked at BDM, MITRE, Sybase, and now Microsoft. Jim has a B.S. in Mathematics and Computer Science and an M.S. in Computer Science from Duke University. Jim blogs at [http://blogs.msdn.com/jimoneil](http://blogs.msdn.com/jimoneil) and can be found on Twitter as @[jimoneil](http://twitter.com/jimoneil).",
        "twitter": {
            "href": "http://twitter.com/jimoneil",
            "title": "jimoneil"
        },
        "sessions": [
            "project-dallas"
        ]
    },
    "jason-pelletier": {
        "slug": "jason-pelletier",
        "firstName": "Jason",
        "lastName": "Pelletier",
        "bio": "Jason Pelletier is Creative Director at [Found Line](http://foundline.com/), a Burlington-based creative firm. His work experience includes web application and print design for Stonyfield Farm, Seventh Generation, Vermont Public Radio, TrueBody Products, ThinkFlood and Common Good Vermont. He can be found on Twitter as @[jason_pelletier](http://twitter.com/jason_pelletier).",
        "twitter": {
            "href": "http://twitter.com/jason_pelletier",
            "title": "jason_pelletier"
        },
        "sessions": [
            "css"
        ]
    },
    "dennis-perlot": {
        "slug": "dennis-perlot",
        "firstName": "Dennis",
        "lastName": "Perlot",
        "bio": "Dennis Perlot has worked on computing platforms ranging from homemade circuit boards to massive mainframes systems and just about everything in between. Prior to joining TyMetrix as Director of Product Development, Dennis architected and managed numerous projects at The Hartford Insurance Group and has consulted for numerous companies in the greater Hartford, CT area. He enjoys his role as a technology evangelist, leverages his teaching skills and his engineering background. He is a frequent speaker at Code Camp events and has presented at the Architect Factory Conference held at Microsoft Research Center in Cambridge, MA. He is a firm believer in the value of building the technical community through users groups. Dennis is on the Board of Directors for the CT Dot NET User Group, Hartford SQL Server User Group and founder of the New England Silverlight Guild. Dennis was honored to receive a Smithsonian Award for data warehouse work in Medicare fraud detection. This project was used by the Government Accounting Office (GAO) and other federal agencies to identify over $110 million of fraud and actually recovered over $11 million. Dennis is a graduate of the University of Connecticut's Computer Science Engineering program and also did graduate work in Artificial Intelligence and Machine Learning.",
        "sessions": [
            "silverlight-part-1"
        ]
    },
    "rob-rohr": {
        "slug": "rob-rohr",
        "firstName": "Rob",
        "lastName": "Rohr",
        "bio": "Rob Rohr has been a developer for the School of Business Administration at the University of Vermont for the past 14 years. Rob has dipped his coding toe in the seas of content management, ink/touch development, mobile development, PowerShell and functional programming and likes to share the programming weirdness that he has encountered along the way. Rob can be found on Twitter as @[rob_rohr](http://twitter.com/rob_rohr).",
        "twitter": {
            "href": "http://twitter.com/rob_rohr",
            "title": "rob_rohr"
        },
        "sessions": [
            "f-sharp-introduction"
        ]
    },
    "nowell-strite": {
        "slug": "nowell-strite",
        "firstName": "Nowell",
        "lastName": "Strite",
        "bio": "Nowell Strite is the Senior Manager of Technology Solutions at the Public Broadcasting Service (PBS) in their Education department. Nowell is happiest when he is wearing many hats: architect,  developer, manager, problem solver, technologist. Most recently, Nowell has taken to Python as his language of choice, however, every problem/job has its own unique set of requirements, and he has worked with a wide range of languages and frameworks in the past (C#, VB, Java, PHP, Perl, ColdFusion). Nowell actively participates in the Open Source community, and enjoys working on existing projects as well as releasing a few of his own. Nowell and his wife recently moved to Huntington, Vermont where they enjoy the non-technological joys in life such as hiking, kayaking and biking. Nowell blogs at [http://nowell.strite.org/](http://nowell.strite.org/) and can be found on most services (including Twitter) as @[nowells](http://twitter.com/nowells)</a>.",
        "twitter": {
            "href": "http://twitter.com/nowells",
            "title": "nowells"
        },
        "sessions": [
            "python-introduction"
        ]
    },
    "kevin-thorley": {
        "slug": "kevin-thorley",
        "firstName": "Kevin",
        "lastName": "Thorley",
        "bio": "Senior software engineer working at [Dealer.com](http://www.dealer.com/) with 10 years of experience developing enterprise applications in Java.",
        "sessions": [
            "git"
        ]
    },
    "matthew-weier-ophinney": {
        "slug": "matthew-weier-ophinney",
        "firstName": "Matthew",
        "lastName": "Weier O'Phinney",
        "bio": "Matthew is an experienced developer in a number of dynamic languages, including Perl, JavaScript, and PHP (his preferred language). Matthew and his family moved to the Vermont in 2003. He worked for two years at the National Gardening Association in South Burlington before being hired by [Zend Technologies](http://www.zend.com/) in 2005. Since starting at Zend, he has been a regular contributor to [Zend Framework](http://framework.zend.com/), a web application framework written in PHP 5. In late 2007, Matthew moved to the Zend Framework team full time, and was appointed project lead in 2009. He has contributed to and started a number of open source projects over the years, primarily in PHP, and is active in the global PHP community. Matthew blogs at [http://weierophinney.net/matthew/](http://weierophinney.net/matthew/) and can be found on Twitter as @[weierophinney](http://twitter.com/weierophinney).",
        "twitter": {
            "href": "http://twitter.com/weierophinney",
            "title": "weierophinney"
        },
        "sessions": [
            "php-introduction"
        ]
    },
    "bill-wilder": {
        "slug": "bill-wilder",
        "firstName": "Bill",
        "lastName": "Wilder",
        "bio": "Bill Wilder has been a professional software developer for more than 20 years. Last year he founded the Boston Azure User Group, an in-person cloud computing community which gets together monthly to learn about Windows Azure through prepared talks and hands-on coding. Bill is especially excited about the Boston Azure Project, a collaborative Windows Azure coding project just starting up in the Boston Azure community. Bill is an active community speaker, blogger ([blog.codingoutloud.com](http://blog.codingoutloud.com/)), and tweeter (@[codingoutloud](http://twitter.com/codingoutloud)) on technology matters and soft skills for technologists, and is also a member of Boston West Toastmasters. Separately, Bill has a day job as an enterprise architect focusing on Microsoft development technologies, including .NET.",
        "twitter": {
            "href": "http://twitter.com/codingoutloud",
            "title": "codingoutloud"
        },
        "sessions": [
            "windows-azure"
        ]
    },
    "chris-yager": {
        "slug": "chris-yager",
        "firstName": "Chris",
        "lastName": "Yager",
        "bio": "Chris Yager is a technical lead at [Dealer.com](http://www.dealer.com/). He previously spent mover than ten years at IBM as a Senior I/T Specialist.",
        "sessions": [
            "build-process"
        ]
    }
}